#include <iostream>

using namespace std;

void A()
{
    cout << "Hello world!" << endl;
    /**
    1. Считать все числа
    2. Вывести их на экран
    3. Вывести все пары
    4. Вывести все тройки
    5. проверить тройки чисел на условие
    6. Вывести только подходящие тройки
    **/
}


int main()
{
    A();
    return 0;
}
